<div style="float:right; padding-top: 15px; padding-right: 15px">
    <div>
        <a href="https://whiteboxml.com">
            <img src="https://whiteboxml.com/static/img/logo/black_bg_white.svg" width="250">
        </a>
    </div>
</div>

# Introduction to Pandas

In [1]:
import numpy as np
import pandas as pd

## 1. Series

In [2]:
array = np.random.random(10)

array

array([0.99627031, 0.376228  , 0.08565706, 0.90365364, 0.45848157,
       0.97706027, 0.22584287, 0.79486337, 0.91101653, 0.40890026])

In [3]:
serie = pd.Series(array)

serie

0    0.996270
1    0.376228
2    0.085657
3    0.903654
4    0.458482
5    0.977060
6    0.225843
7    0.794863
8    0.911017
9    0.408900
dtype: float64

In [4]:
serie.index

RangeIndex(start=0, stop=10, step=1)

In [5]:
range(10)

range(0, 10)

In [6]:
list(serie.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [7]:
for i in serie.index:
    print(i)

0
1
2
3
4
5
6
7
8
9

In [8]:
serie.values

array([0.99627031, 0.376228  , 0.08565706, 0.90365364, 0.45848157,
       0.97706027, 0.22584287, 0.79486337, 0.91101653, 0.40890026])

In [9]:
type(serie.values)

numpy.ndarray

In [10]:
serie[3]

0.9036536351271274

## 2. DataFrames

In [11]:
matrix = np.random.random((10,5))

matrix

array([[0.249178  , 0.14217279, 0.87518769, 0.80236834, 0.00241484],
       [0.47684296, 0.04243522, 0.33611951, 0.43627803, 0.46160587],
       [0.99787371, 0.94789318, 0.05026002, 0.91093484, 0.54653496],
       [0.4421515 , 0.11739271, 0.69844922, 0.98714059, 0.35923931],
       [0.06473486, 0.59001882, 0.28057018, 0.92535893, 0.78949476],
       [0.71224713, 0.5878814 , 0.64480223, 0.26539154, 0.3151872 ],
       [0.68279151, 0.35618183, 0.2134088 , 0.44120339, 0.88323721],
       [0.40449796, 0.31659458, 0.77616474, 0.50594286, 0.43459904],
       [0.50381841, 0.15765921, 0.9005865 , 0.54097609, 0.44126385],
       [0.99634394, 0.09476237, 0.20352739, 0.1462359 , 0.58755648]])

In [12]:
colnames = ['col1', 'col2', 'col3', 'col4', 'col5']
df = pd.DataFrame(matrix, columns=colnames)
df

       col1      col2      col3      col4      col5
0  0.249178  0.142173  0.875188  0.802368  0.002415
1  0.476843  0.042435  0.336120  0.436278  0.461606
2  0.997874  0.947893  0.050260  0.910935  0.546535
3  0.442151  0.117393  0.698449  0.987141  0.359239
4  0.064735  0.590019  0.280570  0.925359  0.789495
5  0.712247  0.587881  0.644802  0.265392  0.315187
6  0.682792  0.356182  0.213409  0.441203  0.883237
7  0.404498  0.316595  0.776165  0.505943  0.434599
8  0.503818  0.157659  0.900586  0.540976  0.441264
9  0.996344  0.094762  0.203527  0.146236  0.587556

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
df.index.to_list()

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [16]:
df.columns

Index(['col1', 'col2', 'col3', 'col4', 'col5'], dtype='object')

In [17]:
df.values

array([[0.249178  , 0.14217279, 0.87518769, 0.80236834, 0.00241484],
       [0.47684296, 0.04243522, 0.33611951, 0.43627803, 0.46160587],
       [0.99787371, 0.94789318, 0.05026002, 0.91093484, 0.54653496],
       [0.4421515 , 0.11739271, 0.69844922, 0.98714059, 0.35923931],
       [0.06473486, 0.59001882, 0.28057018, 0.92535893, 0.78949476],
       [0.71224713, 0.5878814 , 0.64480223, 0.26539154, 0.3151872 ],
       [0.68279151, 0.35618183, 0.2134088 , 0.44120339, 0.88323721],
       [0.40449796, 0.31659458, 0.77616474, 0.50594286, 0.43459904],
       [0.50381841, 0.15765921, 0.9005865 , 0.54097609, 0.44126385],
       [0.99634394, 0.09476237, 0.20352739, 0.1462359 , 0.58755648]])

In [18]:
# this is a series
series = df['col1']

series

0    0.249178
1    0.476843
2    0.997874
3    0.442151
4    0.064735
5    0.712247
6    0.682792
7    0.404498
8    0.503818
9    0.996344
Name: col1, dtype: float64

In [19]:
# beware of the list now
df[['col1', 'col2', 'col3']]

       col1      col2      col3
0  0.249178  0.142173  0.875188
1  0.476843  0.042435  0.336120
2  0.997874  0.947893  0.050260
3  0.442151  0.117393  0.698449
4  0.064735  0.590019  0.280570
5  0.712247  0.587881  0.644802
6  0.682792  0.356182  0.213409
7  0.404498  0.316595  0.776165
8  0.503818  0.157659  0.900586
9  0.996344  0.094762  0.203527

In [20]:
# you will make this mistake
df['col1', 'col2', 'col3']

KeyError: ('col1', 'col2', 'col3')

In [21]:
cols = ['col1', 'col2', 'col3']

df[cols]

       col1      col2      col3
0  0.249178  0.142173  0.875188
1  0.476843  0.042435  0.336120
2  0.997874  0.947893  0.050260
3  0.442151  0.117393  0.698449
4  0.064735  0.590019  0.280570
5  0.712247  0.587881  0.644802
6  0.682792  0.356182  0.213409
7  0.404498  0.316595  0.776165
8  0.503818  0.157659  0.900586
9  0.996344  0.094762  0.203527

In [22]:
# this is a dataframe
df[['col1']]

       col1
0  0.249178
1  0.476843
2  0.997874
3  0.442151
4  0.064735
5  0.712247
6  0.682792
7  0.404498
8  0.503818
9  0.996344

In [23]:
# don't do this but it works
df[['col1']]['col1']

0    0.249178
1    0.476843
2    0.997874
3    0.442151
4    0.064735
5    0.712247
6    0.682792
7    0.404498
8    0.503818
9    0.996344
Name: col1, dtype: float64

In [24]:
df['col1']['col1']

KeyError: 'col1'

### 2.1 Build DataFrames from python objects

#### 2.1.1 From lists

In [25]:
lst = [208500, 181500, 223500, 140000, 250000, 143000, 307000, 200000, 129900, 118000]

price_df = pd.DataFrame(lst, columns=['SalePrice'])
price_df

   SalePrice
0     208500
1     181500
2     223500
3     140000
4     250000
5     143000
6     307000
7     200000
8     129900
9     118000

In [26]:
lst_lst = [[8450, 'CollgCr', 2003, 7, 208500],
           [9600, 'Veenker', 1976, 6, 181500],
           [11250, 'CollgCr', 2001, 7, 223500],
           [9550, 'Crawfor', 1915, 7, 140000],
           [14260, 'NoRidge', 2000, 8, 250000],
           [14115, 'Mitchel', 1993, 5, 143000],
           [10084, 'Somerst', 2004, 8, 307000],
           [10382, 'NWAmes', 1973, 7, 200000],
           [6120, 'OldTown', 1931, 7, 129900],
           [7420, 'BrkSide', 1939, 5, 118000]]

colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']
df = pd.DataFrame(lst_lst, columns=colnames)

df

   LotSize Neighborhood  YearBuilt  Quality  SalePrice
0     8450      CollgCr       2003        7     208500
1     9600      Veenker       1976        6     181500
2    11250      CollgCr       2001        7     223500
3     9550      Crawfor       1915        7     140000
4    14260      NoRidge       2000        8     250000
5    14115      Mitchel       1993        5     143000
6    10084      Somerst       2004        8     307000
7    10382       NWAmes       1973        7     200000
8     6120      OldTown       1931        7     129900
9     7420      BrkSide       1939        5     118000

In [27]:
df.columns

Index(['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice'], dtype='object')

In [28]:
df.columns.to_list()

['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice']

In [29]:
df.dtypes

LotSize          int64
Neighborhood    object
YearBuilt        int64
Quality          int64
SalePrice        int64
dtype: object

#### 2.1.2 From dicts

In [30]:
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 123054],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [31]:
df = pd.DataFrame(house_dict)
df

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,123054,143000,250000,129900,223500,181500,140000,208500,307000,200000

In [32]:
df.dtypes

Baker House        object
Beazley House      object
Dominguez House    object
Hamilton House     object
James House        object
Martinez House     object
Roberts House      object
Smith House        object
Snyder House       object
Zuckerman House    object
dtype: object

In [33]:
df.T

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  123054
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

In [34]:
df.T.index

Index(['Baker House', 'Beazley House', 'Dominguez House', 'Hamilton House',
       'James House', 'Martinez House', 'Roberts House', 'Smith House',
       'Snyder House', 'Zuckerman House'],
      dtype='object')

In [35]:
df.T.columns

RangeIndex(start=0, stop=5, step=1)

In [36]:
colnames

['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice']

In [37]:
df = df.T
df.columns = colnames

df

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    123054
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
Hamilton House     6120      OldTown      1931       7    129900
James House       11250      CollgCr      2001       7    223500
Martinez House     9600      Veenker      1976       6    181500
Roberts House      9550      Crawfor      1915       7    140000
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [38]:
house_dict

{'Baker House': [7420, 'BrkSide', 1939, 5, 123054],
 'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
 'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
 'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
 'James House': [11250, 'CollgCr', 2001, 7, 223500],
 'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
 'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
 'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
 'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
 'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [39]:
# orient='index' means take the dict keys as index (not as column names)
df = pd.DataFrame.from_dict(house_dict, orient='index')
df.columns = colnames

df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

### 2.2 DataFrame operations

In [40]:
# Total price of all houses sold
print(df['SalePrice'].sum())

# Average lot size of houses sold
print(df['LotSize'].mean())

# The latest year a house in the data set was built
print(df['YearBuilt'].max())

# The eariliest year a house in the data set was built
print(df['YearBuilt'].min())

1906454
10123.1
2004
1915

In [41]:
df.sort_values(by='SalePrice', ascending=False)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Snyder House       10084      Somerst       2004        8     307000
Dominguez House    14260      NoRidge       2000        8     250000
James House        11250      CollgCr       2001        7     223500
Smith House         8450      CollgCr       2003        7     208500
Zuckerman House    10382       NWAmes       1973        7     200000
Martinez House      9600      Veenker       1976        6     181500
Beazley House      14115      Mitchel       1993        5     143000
Roberts House       9550      Crawfor       1915        7     140000
Hamilton House      6120      OldTown       1931        7     129900
Baker House         7420      BrkSide       1939        5     123054

In [42]:
df.sort_values(by=['Quality', 'SalePrice'], ascending=False)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Snyder House       10084      Somerst       2004        8     307000
Dominguez House    14260      NoRidge       2000        8     250000
James House        11250      CollgCr       2001        7     223500
Smith House         8450      CollgCr       2003        7     208500
Zuckerman House    10382       NWAmes       1973        7     200000
Roberts House       9550      Crawfor       1915        7     140000
Hamilton House      6120      OldTown       1931        7     129900
Martinez House      9600      Veenker       1976        6     181500
Beazley House      14115      Mitchel       1993        5     143000
Baker House         7420      BrkSide       1939        5     123054

In [43]:
df['LotSize'].sort_values()

Hamilton House      6120
Baker House         7420
Smith House         8450
Roberts House       9550
Martinez House      9600
Snyder House       10084
Zuckerman House    10382
James House        11250
Beazley House      14115
Dominguez House    14260
Name: LotSize, dtype: int64

In [44]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [45]:
# row id, column id
df.loc['Beazley House', 'Neighborhood']

'Mitchel'

In [46]:
# row index, column index
df.iloc[1, 1]

'Mitchel'

In [47]:
df.loc['Beazley House']

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [48]:
df.iloc[1]

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [49]:
df['LotSize']

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [50]:
df.loc[:, 'LotSize']

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [51]:
df.iloc[:, 0]

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [52]:
# to access a certain column use df[col] instead of loc or iloc

In [53]:
# how to select only certain rows

In [54]:
# first 5 rows
df.head()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500

In [55]:
# last 5 rows
df.tail()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [56]:
# random row
df.sample()

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House    14115      Mitchel       1993        5     143000

In [57]:
# certain rows
df.loc[['Roberts House', 'Baker House']]

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Roberts House     9550      Crawfor       1915        7     140000
Baker House       7420      BrkSide       1939        5     123054

In [58]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [59]:
df.shape

(10, 5)

In [60]:
len(df)

10

In [61]:
df.size

50

In [62]:
df['new_col'] = np.random.random(10)

In [63]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice   new_col
Baker House         7420      BrkSide       1939        5     123054  0.843161
Beazley House      14115      Mitchel       1993        5     143000  0.032022
Dominguez House    14260      NoRidge       2000        8     250000  0.619682
Hamilton House      6120      OldTown       1931        7     129900  0.063554
James House        11250      CollgCr       2001        7     223500  0.698385
Martinez House      9600      Veenker       1976        6     181500  0.296114
Roberts House       9550      Crawfor       1915        7     140000  0.057393
Smith House         8450      CollgCr       2003        7     208500  0.328248
Snyder House       10084      Somerst       2004        8     307000  0.415055
Zuckerman House    10382       NWAmes       1973        7     200000  0.741194

In [64]:
df['new_again'] = df['Quality'] * df['SalePrice']

df

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again
Baker House,7420,BrkSide,1939,5,123054,0.843161,615270
Beazley House,14115,Mitchel,1993,5,143000,0.032022,715000
Dominguez House,14260,NoRidge,2000,8,250000,0.619682,2000000
Hamilton House,6120,OldTown,1931,7,129900,0.063554,909300
James House,11250,CollgCr,2001,7,223500,0.698385,1564500
Martinez House,9600,Veenker,1976,6,181500,0.296114,1089000
Roberts House,9550,Crawfor,1915,7,140000,0.057393,980000
Smith House,8450,CollgCr,2003,7,208500,0.328248,1459500
Snyder House,10084,Somerst,2004,8,307000,0.415055,2456000
Zuckerman House,10382,NWAmes,1973,7,200000,0.741194,1400000

## 3. Bonus

In [81]:
df

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again,my_new_column
Baker House,7420,BrkSide,1939,5,123054,0.843161,615270,55056400
Beazley House,14115,Mitchel,1993,5,143000,0.032022,715000,199233225
Dominguez House,14260,NoRidge,2000,8,250000,0.619682,2000000,203347600
Hamilton House,6120,OldTown,1931,7,129900,0.063554,909300,37454400
James House,11250,CollgCr,2001,7,223500,0.698385,1564500,126562500
Martinez House,9600,Veenker,1976,6,181500,0.296114,1089000,92160000
Roberts House,9550,Crawfor,1915,7,140000,0.057393,980000,91202500
Smith House,8450,CollgCr,2003,7,208500,0.328248,1459500,71402500
Snyder House,10084,Somerst,2004,8,307000,0.415055,2456000,101687056
Zuckerman House,10382,NWAmes,1973,7,200000,0.741194,1400000,107785924

In [82]:
serie = df['LotSize']

serie

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

### 3.1 filter

In [83]:
# series (watch the index)
lotsize_filter = serie > 10000

serie[lotsize_filter]

Beazley House      14115
Dominguez House    14260
James House        11250
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [68]:
df

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again
Baker House,7420,BrkSide,1939,5,123054,0.843161,615270
Beazley House,14115,Mitchel,1993,5,143000,0.032022,715000
Dominguez House,14260,NoRidge,2000,8,250000,0.619682,2000000
Hamilton House,6120,OldTown,1931,7,129900,0.063554,909300
James House,11250,CollgCr,2001,7,223500,0.698385,1564500
Martinez House,9600,Veenker,1976,6,181500,0.296114,1089000
Roberts House,9550,Crawfor,1915,7,140000,0.057393,980000
Smith House,8450,CollgCr,2003,7,208500,0.328248,1459500
Snyder House,10084,Somerst,2004,8,307000,0.415055,2456000
Zuckerman House,10382,NWAmes,1973,7,200000,0.741194,1400000

In [84]:
print(df)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice  \
Baker House         7420      BrkSide       1939        5     123054
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

                  new_col  new_again  my_new_column
Baker House      0.843161     615270       55056400
Beazley House    0.032022     715000      199233225
Dominguez House  0.619682    2000000      203347600
Hamilton House   0.063554     909300       37454400
James House      0.698385    1564500      126562500
Martinez House   0.296114    1089000       92160000
Roberts House    0.057393     980000       91202500
Smith House      0.328248    1459500       71402500
Snyder House     0.415055    2456000      101687056
Zuckerman House  0.741194    1400000      107785924

In [94]:
display(df)

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again,my_new_column
Baker House,7420,BrkSide,1939,5,123054,0.843161,615270,55056400
Beazley House,14115,Mitchel,1993,5,143000,0.032022,715000,199233225
Dominguez House,14260,NoRidge,2000,8,250000,0.619682,2000000,203347600
Hamilton House,6120,OldTown,1931,7,129900,0.063554,909300,37454400
James House,11250,CollgCr,2001,7,223500,0.698385,1564500,126562500
Martinez House,9600,Veenker,1976,6,181500,0.296114,1089000,92160000
Roberts House,9550,Crawfor,1915,7,140000,0.057393,980000,91202500
Smith House,8450,CollgCr,2003,7,208500,0.328248,1459500,71402500
Snyder House,10084,Somerst,2004,8,307000,0.415055,2456000,101687056
Zuckerman House,10382,NWAmes,1973,7,200000,0.741194,1400000,107785924

In [69]:
# dataframe
lotsize_filter = df['LotSize'] > 10000
quality_filter = df['Quality'] > 7

display(df[lotsize_filter & quality_filter])
display(df[lotsize_filter | quality_filter])
display(df[~(lotsize_filter & quality_filter)])

# if equivalences:
# and -> &
# or -> |
# not -> ~

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again
Dominguez House,14260,NoRidge,2000,8,250000,0.619682,2000000
Snyder House,10084,Somerst,2004,8,307000,0.415055,2456000

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again
Beazley House,14115,Mitchel,1993,5,143000,0.032022,715000
Dominguez House,14260,NoRidge,2000,8,250000,0.619682,2000000
James House,11250,CollgCr,2001,7,223500,0.698385,1564500
Snyder House,10084,Somerst,2004,8,307000,0.415055,2456000
Zuckerman House,10382,NWAmes,1973,7,200000,0.741194,1400000

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again
Baker House,7420,BrkSide,1939,5,123054,0.843161,615270
Beazley House,14115,Mitchel,1993,5,143000,0.032022,715000
Hamilton House,6120,OldTown,1931,7,129900,0.063554,909300
James House,11250,CollgCr,2001,7,223500,0.698385,1564500
Martinez House,9600,Veenker,1976,6,181500,0.296114,1089000
Roberts House,9550,Crawfor,1915,7,140000,0.057393,980000
Smith House,8450,CollgCr,2003,7,208500,0.328248,1459500
Zuckerman House,10382,NWAmes,1973,7,200000,0.741194,1400000

### 3.2 map

In [86]:
serie

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [71]:
serie.apply(lambda x: x * 2)

Baker House        14840
Beazley House      28230
Dominguez House    28520
Hamilton House     12240
James House        22500
Martinez House     19200
Roberts House      19100
Smith House        16900
Snyder House       20168
Zuckerman House    20764
Name: LotSize, dtype: int64

In [72]:
df[['LotSize', 'Quality']].apply(lambda x: x * 2)

                 LotSize  Quality
Baker House        14840       10
Beazley House      28230       10
Dominguez House    28520       16
Hamilton House     12240       14
James House        22500       14
Martinez House     19200       12
Roberts House      19100       14
Smith House        16900       14
Snyder House       20168       16
Zuckerman House    20764       14

In [87]:
df.apply(lambda x: x * 2)

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again,my_new_column
Baker House,14840,BrkSideBrkSide,3878,10,246108,1.686322,1230540,110112800
Beazley House,28230,MitchelMitchel,3986,10,286000,0.064044,1430000,398466450
Dominguez House,28520,NoRidgeNoRidge,4000,16,500000,1.239364,4000000,406695200
Hamilton House,12240,OldTownOldTown,3862,14,259800,0.127108,1818600,74908800
James House,22500,CollgCrCollgCr,4002,14,447000,1.396771,3129000,253125000
Martinez House,19200,VeenkerVeenker,3952,12,363000,0.592229,2178000,184320000
Roberts House,19100,CrawforCrawfor,3830,14,280000,0.114786,1960000,182405000
Smith House,16900,CollgCrCollgCr,4006,14,417000,0.656496,2919000,142805000
Snyder House,20168,SomerstSomerst,4008,16,614000,0.830109,4912000,203374112
Zuckerman House,20764,NWAmesNWAmes,3946,14,400000,1.482387,2800000,215571848

In [95]:
df['YearBuilt'].apply(lambda x: x + 100)

Baker House        2039
Beazley House      2093
Dominguez House    2100
Hamilton House     2031
James House        2101
Martinez House     2076
Roberts House      2015
Smith House        2103
Snyder House       2104
Zuckerman House    2073
Name: YearBuilt, dtype: int64

In [91]:
df['YearBuilt']

Baker House        1939
Beazley House      1993
Dominguez House    2000
Hamilton House     1931
James House        2001
Martinez House     1976
Roberts House      1915
Smith House        2003
Snyder House       2004
Zuckerman House    1973
Name: YearBuilt, dtype: int64

In [96]:
df['YearBuilt'] = df['YearBuilt'].apply(lambda x: x + 100)

In [97]:
df

,LotSize,Neighborhood,YearBuilt,Quality,SalePrice,new_col,new_again,my_new_column
Baker House,7420,BrkSide,2039,5,123054,0.843161,615270,55056400
Beazley House,14115,Mitchel,2093,5,143000,0.032022,715000,199233225
Dominguez House,14260,NoRidge,2100,8,250000,0.619682,2000000,203347600
Hamilton House,6120,OldTown,2031,7,129900,0.063554,909300,37454400
James House,11250,CollgCr,2101,7,223500,0.698385,1564500,126562500
Martinez House,9600,Veenker,2076,6,181500,0.296114,1089000,92160000
Roberts House,9550,Crawfor,2015,7,140000,0.057393,980000,91202500
Smith House,8450,CollgCr,2103,7,208500,0.328248,1459500,71402500
Snyder House,10084,Somerst,2104,8,307000,0.415055,2456000,101687056
Zuckerman House,10382,NWAmes,2073,7,200000,0.741194,1400000,107785924

In [99]:
df['LotSize'] * 2 + 100

Baker House        14940
Beazley House      28330
Dominguez House    28620
Hamilton House     12340
James House        22600
Martinez House     19300
Roberts House      19200
Smith House        17000
Snyder House       20268
Zuckerman House    20864
Name: LotSize, dtype: int64

In [100]:
series_to_add = df['LotSize']

series_to_add

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [101]:
# I'm creating a new column
df['my_new_column'] = series_to_add.apply(lambda x: x ** 2)

In [103]:
df['my_new_column'] ** 2

Baker House         3031207180960000
Beazley House      39693877943900625
Dominguez House    41350246425760000
Hamilton House      1402832079360000
James House        16018066406250000
Martinez House      8493465600000000
Roberts House       8317896006250000
Smith House         5098317006250000
Snyder House       10340257357947136
Zuckerman House    11617805412533776
Name: my_new_column, dtype: int64

In [106]:
df['LotSize']

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [105]:
df['LotSize'].apply(print)

7420
14115
14260
6120
11250
9600
9550
8450
10084
10382

Baker House        None
Beazley House      None
Dominguez House    None
Hamilton House     None
James House        None
Martinez House     None
Roberts House      None
Smith House        None
Snyder House       None
Zuckerman House    None
Name: LotSize, dtype: object

<div style="padding-top: 25px; float: right">
    <div>    
        <i>&nbsp;&nbsp;© Copyright by</i>
    </div>
    <div>
        <a href="https://whiteboxml.com">
            <img src="https://whiteboxml.com/static/img/logo/black_bg_white.svg" width="125">
        </a>
    </div>
</div>